In [13]:
# 판다스의 시리즈
import pandas as pd

a_series = pd.Series({'a':10,'b':20,'c':30,'d':40, 'e':30}) # 딕셔너리의 키가 인덱스명, 값이 value
print(a_series)
print(type(a_series))

a    10
b    20
c    30
d    40
e    30
dtype: int64
<class 'pandas.core.series.Series'>

In [110]:
# 시리즈의 데이터 선택 : 시리즈명[] -> 인덱스명 또는 인덱스 첨자
print(a_series.index, a_series.values); print()
print(a_series.value_counts()); print()
print(a_series['a'], a_series[0]); print()
print(a_series[[0,2]]); print() # 여러개 선택시 리스트로 선택
print(a_series[0:2]); print() # 숫자로 슬라이싱 start:end -> end미포함
print(a_series['a':'c']); print() # 인덱스명 start:end -> end포함

Index(['a', 'b', 'c', 'd', 'e'], dtype='object') [10 20 30 40 30]

30    2
10    1
20    1
40    1
dtype: int64

10 10

a    10
c    30
dtype: int64

a    10
b    20
dtype: int64

a    10
b    20
c    30
dtype: int64

In [25]:
# b_series = pd.Series([10,'test', True,'data'], index=['a','b','c','d'])
b_series = pd.Series([10,'test', True,'data'])
print(b_series)
b_series.index = ['a','b','c','d'] # 인덱스명 추가
print(b_series)

0      10
1    test
2    True
3    data
dtype: object
a      10
b    test
c    True
d    data
dtype: object

In [111]:
#데이터프레임 : 여러 개의 시리즈가 모여서 만들어짐
# 딕셔너리의 키는 컬럼명(시리즈 이름)이 됨
# pandas.DataFrame(딕셔너리, index = 행이름, columns= 열이름)
dict_data = {'c0':[1,2,3],'c1':[0,9,8],'c2':[4,5,6],'c3':[7,8,9]}

df = pd.DataFrame(dict_data) # 데이터프레임 생성
print(df); print()
print(df.columns, df.index); print() # 컬럼명, 인덱스명 출력
df.index = ['a','b','c']
print(df); print()
print(df.columns, df.index); print()
df.columns = ['a1','a2','a3','a4']
print(df); print()
print(df.columns, df.index); print()

   c0  c1  c2  c3
0   1   0   4   7
1   2   9   5   8
2   3   8   6   9

Index(['c0', 'c1', 'c2', 'c3'], dtype='object') RangeIndex(start=0, stop=3, step=1)

   c0  c1  c2  c3
a   1   0   4   7
b   2   9   5   8
c   3   8   6   9

Index(['c0', 'c1', 'c2', 'c3'], dtype='object') Index(['a', 'b', 'c'], dtype='object')

   a1  a2  a3  a4
a   1   0   4   7
b   2   9   5   8
c   3   8   6   9

Index(['a1', 'a2', 'a3', 'a4'], dtype='object') Index(['a', 'b', 'c'], dtype='object')

In [112]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                  index=['a','b','c'],
                  columns=['c1','c2','c3'])
print(df)

   c1  c2  c3
a   1   2   3
b   4   5   6
c   7   8   9

In [43]:
# 행 인덱스 / 열 이름 지정
df = pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],
                 index=['준서','예은'], columns=['나이','성별','학교'])
print(df)
print()
# 행 일부 이름 변경 df.rename(index={기존 인덱스명:새로운 인덱스명, ...})
# 열 일부 이름 변경 df.rename(columns={기존 컬럼명:새로운 컬럼명, ...})
df.rename(index={'준서':'학생1'},inplace=True)
# inplace = True 기존의 데이터 변경
print(df)
print()
df.rename(columns={'성별':'남여'},inplace=True)
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

     나이 성별   학교
학생1  15  남  덕영중
예은   17  여  수리중

     나이 남여   학교
학생1  15  남  덕영중
예은   17  여  수리중

In [117]:
exam_data = {'수학':[90,80,70],'영어':[98,89,95],
            '음악':[85,95,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)
print(df)
print()

# 데이터프레임 인덱스명 추가
df.index = ['서준','우현','인아']
print(df); print()

df2 = df.copy()
# '우현' 자료를 삭제 (행을 삭제)
df2.drop('우현',inplace=True)
print(df2)
print()
# '수학','체육' 자료 삭제 (열을 삭제)
df2.drop(['수학','체육'],axis=1,inplace=True)
print(df2)

   수학  영어   음악   체육
0  90  98   85  100
1  80  89   95   90
2  70  95  100   90

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

    영어   음악
서준  98   85
인아  95  100

In [120]:
exam_data = {'수학':[90,80,70],'영어':[98,89,95],
            '음악':[85,95,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)
df2 = df.copy()

df2.index = ['서준','우현','민아']
print(df2)
print()

# 인덱스로 데이터 접근
# 행 선택 -> df.loc[인덱스명], df.iloc[인덱스첨자]
print(df2.loc['서준'])
print(df2.iloc[0])
print()

#'서준'과 '우현' 자료를 검색
print(df2.loc[['서준','우현']])
print(df2.loc['서준':'우현']) # 범위선택시 마지막 인덱스 포함
print(df2.iloc[[0,1]])
print(df2.iloc[0:2]) # 범위선택시 마지막 인덱스 미포함
print()

# 컬럼 자료 출력
print(df2['수학'])
print(df2.수학)
print()
# 수학,영어,음악 점수 출력
print(df2[['수학','영어','음악']]) # df2['수학':'음악'] - 더이상 지원안함
print()

# 국어 점수를 100,80,90을 df2에 추가
df2['국어']=[100,80,90]
print(df2)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
민아  70  95  100   90

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

서준    90
우현    80
민아    70
Name: 수학, dtype: int64
서준    90
우현    80
민아    70
Name: 수학, dtype: int64

    수학  영어   음악
서준  90  98   85
우현  80  89   95
민아  70  95  100

    수학  영어   음악   체육   국어
서준  90  98   85  100  100
우현  80  89   95   90   80
민아  70  95  100   90   90

In [80]:
df2
# 음악과 국어 점수 출력
print(df2[['음악','국어']])
# 서준과 우현의 점수 출력
print(df2.loc[['서준','우현']])
# 수학,영어,음악 점수 출력
print(df2[['수학','영어','음악']]) # df2['수학':'음악'] - 더이상 지원안함

     음악   국어
서준   85  100
우현   95   80
민아  100   90
    수학  영어  음악   체육   국어
서준  90  98  85  100  100
우현  80  89  95   90   80
    수학  영어   음악
서준  90  98   85
우현  80  89   95
민아  70  95  100

In [125]:
print(df2)
# 새로운 행 추가 df.loc[인덱스명] = [값, ...]
df2.loc['철수'] = [100,80,98,77,90]
print(df2)

    수학  영어   음악   체육   국어
민아  70  95  100   90   90
서준  90  98   85  100  100
우현  80  89   95   90   80
     수학  영어   음악   체육   국어
민아   70  95  100   90   90
서준   90  98   85  100  100
우현   80  89   95   90   80
철수  100  80   98   77   90

In [92]:
# 각 원소 접근 df.loc[인덱스명, 컬럼명], df.loc[인덱스명][컬럼명]
# df.iloc[인덱스첨자, 컬럼위치 인덱스], df.iloc[인덱스첨자][컬럼위치]
# 서준의 영어점수 검색
print(df2.loc['서준','영어'],df2.loc['서준']['영어'],df2.loc['서준'][1])
print(df2.iloc[0,1],df2.iloc[0]['영어'],df2.iloc[0][1])

# 서준과 우현의 영어 점수
print(df2.loc[['서준','우현'],'영어'])

# 서준의 영어점수를 100으로 수정
df2.loc['서준','영어'] = 100
print(df2)

# 서준부터 민아까지의 수학과 영어점수를 출력
print(df2.loc['서준':'민아',['수학','영어']])
print(df2.loc['서준':'민아'][['수학','영어']])

100 100 100
100 100 100
서준    100
우현     89
Name: 영어, dtype: int64
     수학   영어   음악   체육   국어
서준   90  100   85  100  100
우현   80   89   95   90   80
민아   70   95  100   90   90
철수  100   80   98   77   90
    수학   영어
서준  90  100
우현  80   89
민아  70   95
    수학   영어
서준  90  100
우현  80   89
민아  70   95

In [107]:
df3 = df.copy()
# 이름을 추가 컬럼명 이름: 우현, 서준, 민아
df3['이름'] = ['우현','서준','민아']
print(df3)

# 특정 컬럼을 인덱스로 설정
# df.set_index(컬럼명, inplace = True)
df3.set_index('이름',inplace=True)
print(df3)

# 인덱스 초기화 df.reset_index(inplace=True)
df3.reset_index(inplace=True)
print(df3)

   수학  영어   음악   체육  이름
0  90  98   85  100  우현
1  80  89   95   90  서준
2  70  95  100   90  민아
    수학  영어   음악   체육
이름
우현  90  98   85  100
서준  80  89   95   90
민아  70  95  100   90
   이름  수학  영어   음악   체육
0  우현  90  98   85  100
1  서준  80  89   95   90
2  민아  70  95  100   90

In [108]:
# 행 인덱스 재배열
df3.set_index('이름',inplace=True)
df3.index

Index(['우현', '서준', '민아'], dtype='object', name='이름')

In [123]:
df3 = df3.reindex(['철수','우현','서준','민아'])
print(df3)

      수학    영어     음악     체육
이름
철수   NaN   NaN    NaN    NaN
우현  90.0  98.0   85.0  100.0
서준  80.0  89.0   95.0   90.0
민아  70.0  95.0  100.0   90.0

In [126]:
# 데이터프레임 : 2차원 배열 ( 시리즈가 열로 묶인 배열 )
# 인덱스 접근방법 : df.loc[인덱스명], 값이 여러개 df.loc[ [인덱스명, ...] ]
# 컬럼 접근 방법 : df[컬럼명]
# 원소 접근 방법 : df.loc[인덱스명, 컬럼명],
#                  df.iloc[인덱스첨자, 컬럼첨자] 
# 인덱스 생성 : df.index = [ 인덱스명, ...]
# 특정 컬럼을 인덱스로 : df.set_index(컬럼명, inplace=True)
# 인덱스 초기화 : df.reset_index(inplace=True)
# 인덱스 재배열 : df.reindex([인덱스명, ...])
# 인덱스 삭제 : df.drop(index=[인덱스명])
# 컬럼 삭제 : df.drop(columns=[컬럼명], axis=1)
print(df2); print()
print(df2.iloc[0:2,1:3]); print()
print(df2.iloc[:2,:])
print(df2.iloc[:,:])

# index를 기준으로 정렬 : df.sort_index(inplace=True) ascending=True 오름차순
df2.sort_index(inplace=True)
print(df2); print()

# value를 기준으로 정렬 : df.sort_values(by=컬럼명, ascending=False) 내림차순
df2.sort_values(by='수학',ascending=False,inplace=True)
print(df2); print()

     수학  영어   음악   체육   국어
민아   70  95  100   90   90
서준   90  98   85  100  100
우현   80  89   95   90   80
철수  100  80   98   77   90

    영어   음악
민아  95  100
서준  98   85

    수학  영어   음악   체육   국어
민아  70  95  100   90   90
서준  90  98   85  100  100
     수학  영어   음악   체육   국어
민아   70  95  100   90   90
서준   90  98   85  100  100
우현   80  89   95   90   80
철수  100  80   98   77   90

     수학  영어   음악   체육   국어
철수  100  80   98   77   90
서준   90  98   85  100  100
우현   80  89   95   90   80
민아   70  95  100   90   90

In [129]:
df = pd.DataFrame({"a": [1, 2, 3, 4]}, index=[ 'C', 'A', 'b', 'd'])
print(df)
print(df.sort_index(key=lambda x: x.str.lower()))

   a
C  1
A  2
b  3
d  4
   a
A  2
b  3
C  1
d  4

In [133]:
df_t = df2.transpose()
print(df_t)
print(df2)

     민아   서준  우현   철수
수학   70   90  80  100
영어   95   98  89   80
음악  100   85  95   98
체육   90  100  90   77
국어   90  100  80   90
     수학  영어   음악   체육   국어
민아   70  95  100   90   90
서준   90  98   85  100  100
우현   80  89   95   90   80
철수  100  80   98   77   90

In [146]:
df2.reindex(['서준','우현','민아','철수','a'],fill_value=0)

     수학  영어   음악   체육   국어
서준   90  98   85  100  100
우현   80  89   95   90   80
민아   70  95  100   90   90
철수  100  80   98   77   90
a     0   0    0    0    0

In [200]:
# 시리즈 연산 : 시리즈 + 사칙연산 + 숫자
sr1 = pd.Series({'국어':100, '수학':90, '영어':90})
print(sr1); print()

# 각 점수에 100을 더한 값을 출력
print(sr1+100); print()

# 각 점수에 100을 나눈 값을 출력
print(sr1/100)

국어    100
수학     90
영어     90
dtype: int64

국어    200
수학    190
영어    190
dtype: int64

국어    1.0
수학    0.9
영어    0.9
dtype: float64

In [201]:
# 시리즈 + 사칙연산 + 시리즈
sr1 = pd.Series({'국어':100, '수학':90, '영어':90})
sr2 = pd.Series({'영어':100, '국어':90, '수학':90, '과학':90})
print(sr1 + sr2); print()

print(sr1.add(sr2,fill_value=0)) # fill_value에 값을 넣어 NaN해결

과학      NaN
국어    190.0
수학    180.0
영어    190.0
dtype: float64

과학     90.0
국어    190.0
수학    180.0
영어    190.0
dtype: float64

In [169]:
# 데이터프레임 연산
import seaborn as sns

df = sns.load_dataset('titanic')
print(df.head())
df = df[['age','fare']]
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [175]:
df1 = df.head().copy()
df2 = df.tail().copy()
print(df1); print()
print(df2); print()

df1.reset_index(inplace=True)
df2.reset_index(inplace=True)
print(df1); print()
print(df2); print()

df1.drop(columns='index',axis=1,inplace=True)
df2.drop(columns='index',axis=1,inplace=True)
print(df1); print()
print(df2); print()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

   index   age     fare
0      0  22.0   7.2500
1      1  38.0  71.2833
2      2  26.0   7.9250
3      3  35.0  53.1000
4      4  35.0   8.0500

   index   age   fare
0    886  27.0  13.00
1    887  19.0  30.00
2    888   NaN  23.45
3    889  26.0  30.00
4    890  32.0   7.75

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

    age   fare
0  27.0  13.00
1  19.0  30.00
2   NaN  23.45
3  26.0  30.00
4  32.0   7.75

In [176]:
df1 + df2

    age      fare
0  49.0   20.2500
1  57.0  101.2833
2   NaN   31.3750
3  61.0   83.1000
4  67.0   15.8000

In [178]:
# seaborn 에서 제공하는 데이터셋 확인
print(sns.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'taxis', 'tips', 'titanic']

In [185]:
# seaborn 에서 제공하는 데이터세을 불러와서 작업
# sns.load_dataset(데이터셋명)
df = sns.load_dataset('iris')
print(df.head()) # 처음 5개의 데이터 확인
df.info() # 데이터프레임의 구조 확인, 각 칼럼의 자료 타입, 데이터의 총 갯수
print(df.tail()) # 마지막 5개의 데이터 확인
print(df.describe()) # 간단한 통계정보 확인
print(df.columns)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB
     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica
       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000
Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [199]:
# mpg 데이터 셋을 불러와서 처음 5개의 데이터를 확인
df = sns.load_dataset('mpg')
print(df.head())
# mpg의 컬럼명 확인
print(df.columns)
# mpg에서 int인 컬럼만 10번째 부터 100번째 까지의 자료만 추출
df.info()
print(df.index)
df1 = df.loc[9:99,['cylinders','weight','model_year']].copy()
print(df1)
df2 = df.iloc[9:100,[1,4,6]].copy()
print(df2)

    mpg  cylinders  displacement  horsepower  weight  acceleration  \
0  18.0          8         307.0       130.0    3504          12.0
1  15.0          8         350.0       165.0    3693          11.5
2  18.0          8         318.0       150.0    3436          11.0
3  16.0          8         304.0       150.0    3433          12.0
4  17.0          8         302.0       140.0    3449          10.5

   model_year origin                       name
0          70    usa  chevrolet chevelle malibu
1          70    usa          buick skylark 320
2          70    usa         plymouth satellite
3          70    usa              amc rebel sst
4          70    usa                ford torino
Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model_year', 'origin', 'name'],
      dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    object
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB
RangeIndex(start=0, stop=398, step=1)
    cylinders  weight  model_year
9           8    3850          70
10          8    3563          70
11          8    3609          70
12          8    3761          70
13          8    3086          70
..        ...     ...         ...
95          8    4951          73
96          8    3821          73
97          6    3121          73
98          6    3278          73
99          6    2945          73

[91 rows x 3 columns]
    cylinders  weight  model_year
9           8    3850          70
10          8    3563          70
11          8    3609          70
12          8    3761          70
13          8    3086          70
..        ...     ...         ...
95          8    4951          73
96          8    3821          73
97          6    3121          73
98          6    3278          73
99          6    2945          73

[91 rows x 3 columns]

In [208]:
# 컬럼의 데이터 타입이 int64인 컬럼만 검색
int_columns = [col for col in df.columns if df[col].dtype =='int64']

df.loc[10:100,int_columns] # 원하는 인덱스와 컬럼만 검색

     cylinders  weight  model_year
10           8    3563          70
11           8    3609          70
12           8    3761          70
13           8    3086          70
14           4    2372          70
..         ...     ...         ...
96           8    3821          73
97           6    3121          73
98           6    3278          73
99           6    2945          73
100          6    3021          73

[91 rows x 3 columns]